Public Attributes | List of all members
API_WallQuantity Struct Reference
Element Manager API
Describes the different calculated values for walls. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | volume
volume of the wall
double  | volume_cond
conditional volume of the wall
double  | volumeASkin
wall skin volume on the reference line side
double  | volumeBSkin
wall skin volume on the side opposite to the reference line
double  | volumeASkin_cond
conditional wall skin volume on the reference line side
double  | volumeBSkin_cond
conditional wall skin volume on the side opposite to the reference line
double  | surface1
surface of the wall on the reference line side
double  | surface2
surface of the wall on the side opposite to the reference line
double  | surface3
surface of the edge of the wall
double  | surface1_cond
conditional surface of the wall on the reference line side
double  | surface2_cond
conditional surface of the wall on the side opposite to the reference line
double  | length
length of the wall (average of the length on the reference line side and on the side opposite to the reference line)
double  | windowsSurf
surface of windows in the wall
double  | doorsSurf
surface of doors in the wall
double  | emptyholesSurf
surface of empty openings in the wall
Int32  | columnsNumber
number of columns in the wall
double  | windowsWidth
combined width of windows in the wall
double  | doorsWidth
combined width of doors in the wall
double  | minHeight
Minimum height of the wall.
double  | maxHeight
Maximum height of the wall.
double  | minHeightASkin
Minimum height of the wall skin on the reference line side.
double  | maxHeightASkin
Maximum height of the wall skin on the reference line.
double  | minHeightBSkin
Minimum height of the wall skin on the side opposite to the reference line.
double  | maxHeightBSkin
Maximum height of the wall skin on the side opposite to the reference line.
double  | centerLength
Length of the wall at the center.
double  | area
Area of the wall.
double  | perimeter
Perimeter of the wall.
double  | grossVolume
Gross volume of the wall.
double  | grossSurf1
Gross surface of the wall on the reference line side.
double  | grossSurf2
Gross surface of the wall on the side opposite to the reference line.
double  | emptyHolesVolume
Analytic volume of openings in the wall.
double  | emptyHolesSurf1
Analytic surface of openings on the reference line side.
double  | emptyHolesSurf2
Analytic surface of openings on the side opposite to the reference line.
double  | length12
Length of the wall on the reference line side.
double  | length34
Length of the wall on the side opposite to the reference line.
double  | length12_cond
Conditional length of the wall on the reference line side.
double  | length34_cond
Conditional length of the wall on the side opposite to the reference line.
double  | insuThickness
Wall insulation skin thickness.
double  | airThickness
Wall air skin thickness.
double  | skinAThickness
Wall skin thickness on the reference line side.
double  | skinBThickness
Wall skin thickness on the side opposite to the reference line.
double  | refLineLength
Length of the reference line.
Detailed Description
Describes the different calculated values for walls.
Remarks
See also the wall parameters for listing in Appendix A of the GDL Reference manual. The columnsVolume member was never calculated, so we removed it in API 21.
Member Data Documentation
◆ airThickness
 API_WallQuantity::airThickness
Wall air skin thickness.
◆ area
 API_WallQuantity::area
Area of the wall.
◆ centerLength
 API_WallQuantity::centerLength
Length of the wall at the center.
◆ columnsNumber
 API_WallQuantity::columnsNumber
number of columns in the wall
◆ doorsSurf
 API_WallQuantity::doorsSurf
surface of doors in the wall
◆ doorsWidth
 API_WallQuantity::doorsWidth
combined width of doors in the wall
◆ emptyholesSurf
 API_WallQuantity::emptyholesSurf
surface of empty openings in the wall
◆ emptyHolesSurf1
 API_WallQuantity::emptyHolesSurf1
Analytic surface of openings on the reference line side.
◆ emptyHolesSurf2
 API_WallQuantity::emptyHolesSurf2
Analytic surface of openings on the side opposite to the reference line.
◆ emptyHolesVolume
 API_WallQuantity::emptyHolesVolume
Analytic volume of openings in the wall.
◆ grossSurf1
 API_WallQuantity::grossSurf1
Gross surface of the wall on the reference line side.
◆ grossSurf2
 API_WallQuantity::grossSurf2
Gross surface of the wall on the side opposite to the reference line.
◆ grossVolume
 API_WallQuantity::grossVolume
Gross volume of the wall.
◆ insuThickness
 API_WallQuantity::insuThickness
Wall insulation skin thickness.
◆ length
 API_WallQuantity::length
length of the wall (average of the length on the reference line side and on the side opposite to the reference line)
◆ length12
 API_WallQuantity::length12
Length of the wall on the reference line side.
◆ length12_cond
 API_WallQuantity::length12_cond
Conditional length of the wall on the reference line side.
◆ length34
 API_WallQuantity::length34
Length of the wall on the side opposite to the reference line.
◆ length34_cond
 API_WallQuantity::length34_cond
Conditional length of the wall on the side opposite to the reference line.
◆ maxHeight
 API_WallQuantity::maxHeight
Maximum height of the wall.
◆ maxHeightASkin
 API_WallQuantity::maxHeightASkin
Maximum height of the wall skin on the reference line.
◆ maxHeightBSkin
 API_WallQuantity::maxHeightBSkin
Maximum height of the wall skin on the side opposite to the reference line.
◆ minHeight
 API_WallQuantity::minHeight
Minimum height of the wall.
◆ minHeightASkin
 API_WallQuantity::minHeightASkin
Minimum height of the wall skin on the reference line side.
◆ minHeightBSkin
 API_WallQuantity::minHeightBSkin
Minimum height of the wall skin on the side opposite to the reference line.
◆ perimeter
 API_WallQuantity::perimeter
Perimeter of the wall.
◆ refLineLength
 API_WallQuantity::refLineLength
Length of the reference line.
◆ skinAThickness
 API_WallQuantity::skinAThickness
Wall skin thickness on the reference line side.
◆ skinBThickness
 API_WallQuantity::skinBThickness
Wall skin thickness on the side opposite to the reference line.
◆ surface1
 API_WallQuantity::surface1
surface of the wall on the reference line side
◆ surface1_cond
 API_WallQuantity::surface1_cond
conditional surface of the wall on the reference line side
◆ surface2
 API_WallQuantity::surface2
surface of the wall on the side opposite to the reference line
◆ surface2_cond
 API_WallQuantity::surface2_cond
conditional surface of the wall on the side opposite to the reference line
◆ surface3
 API_WallQuantity::surface3
surface of the edge of the wall
◆ volume
 API_WallQuantity::volume
volume of the wall
◆ volume_cond
 API_WallQuantity::volume_cond
conditional volume of the wall
◆ volumeASkin
 API_WallQuantity::volumeASkin
wall skin volume on the reference line side
◆ volumeASkin_cond
 API_WallQuantity::volumeASkin_cond
conditional wall skin volume on the reference line side
◆ volumeBSkin
 API_WallQuantity::volumeBSkin
wall skin volume on the side opposite to the reference line
◆ volumeBSkin_cond
 API_WallQuantity::volumeBSkin_cond
conditional wall skin volume on the side opposite to the reference line
◆ windowsSurf
 API_WallQuantity::windowsSurf
surface of windows in the wall
◆ windowsWidth
 API_WallQuantity::windowsWidth
combined width of windows in the wall